TexasInstruments/simplelink-lowpower-f2-sdk/source/ti/devices/cc13x4_cc26x4/inc/hw_cpu_scs.h
/******************************************************************************
*  Filename:       hw_cpu_scs_h
*
* Copyright (c) 2015 - 2017, Texas Instruments Incorporated
* All rights reserved.
*
* Redistribution and use in source and binary forms, with or without
* modification, are permitted provided that the following conditions are met:
*
* 1) Redistributions of source code must retain the above copyright notice,
*    this list of conditions and the following disclaimer.
*
* 2) Redistributions in binary form must reproduce the above copyright notice,
*    this list of conditions and the following disclaimer in the documentation
*    and/or other materials provided with the distribution.
*
* 3) Neither the name of the ORGANIZATION nor the names of its contributors may
*    be used to endorse or promote products derived from this software without
*    specific prior written permission.
*
* THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
* AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
* IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
* ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE
* LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
* CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
* SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
* INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
* CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
* ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
* POSSIBILITY OF SUCH DAMAGE.
*
******************************************************************************/

#ifndef __HW_CPU_SCS_H__
#define __HW_CPU_SCS_H__

//*****************************************************************************
//
// This section defines the register offsets of
// CPU_SCS component
//
//*****************************************************************************
// CPUID Base
#define CPU_SCS_O_CPUID                                             0x00000000

// Interrupt Control State
#define CPU_SCS_O_ICSR                                              0x00000004

// Vector Table Offset
#define CPU_SCS_O_VTOR                                              0x00000008

// Application Interrupt/Reset Control
#define CPU_SCS_O_AIRCR                                             0x0000000C

// System Control
#define CPU_SCS_O_SCR                                               0x00000010

// Configuration Control
#define CPU_SCS_O_CCR                                               0x00000014

// System Handlers 4-7 Priority
#define CPU_SCS_O_SHPR1                                             0x00000018

// System Handlers 8-11 Priority
#define CPU_SCS_O_SHPR2                                             0x0000001C

// System Handlers 12-15 Priority
#define CPU_SCS_O_SHPR3                                             0x00000020

// System Handler Control and State
#define CPU_SCS_O_SHCSR                                             0x00000024

// Configurable Fault Status
#define CPU_SCS_O_CFSR                                              0x00000028

// Hard Fault Status
#define CPU_SCS_O_HFSR                                              0x0000002C

// Debug Fault Status
#define CPU_SCS_O_DFSR                                              0x00000030

// Mem Manage Fault Address
#define CPU_SCS_O_MMFAR                                             0x00000034

// Bus Fault Address
#define CPU_SCS_O_BFAR                                              0x00000038

// Auxiliary Fault Status
#define CPU_SCS_O_AFSR                                              0x0000003C

// Processor Feature 0
#define CPU_SCS_O_ID_PFR0                                           0x00000040

// Processor Feature 1
#define CPU_SCS_O_ID_PFR1                                           0x00000044

// Debug Feature 0
#define CPU_SCS_O_ID_DFR0                                           0x00000048

// Auxiliary Feature 0
#define CPU_SCS_O_ID_AFR0                                           0x0000004C

// Memory Model Feature 0
#define CPU_SCS_O_ID_MMFR0                                          0x00000050

// Memory Model Feature 1
#define CPU_SCS_O_ID_MMFR1                                          0x00000054

// Memory Model Feature 2
#define CPU_SCS_O_ID_MMFR2                                          0x00000058

// Memory Model Feature 3
#define CPU_SCS_O_ID_MMFR3                                          0x0000005C

// ISA Feature 0
#define CPU_SCS_O_ID_ISAR0                                          0x00000060

// ISA Feature 1
#define CPU_SCS_O_ID_ISAR1                                          0x00000064

// ISA Feature 2
#define CPU_SCS_O_ID_ISAR2                                          0x00000068

// ISA Feature 3
#define CPU_SCS_O_ID_ISAR3                                          0x0000006C

// ISA Feature 4
#define CPU_SCS_O_ID_ISAR4                                          0x00000070

//*****************************************************************************
//
// Register: CPU_SCS_O_CPUID
//
//*****************************************************************************
// Field: [31:24] IMPLEMENTER
//
// Implementor code.
#define CPU_SCS_CPUID_IMPLEMENTER_W                                          8
#define CPU_SCS_CPUID_IMPLEMENTER_M                                 0xFF000000
#define CPU_SCS_CPUID_IMPLEMENTER_S                                         24

// Field: [23:20] VARIANT
//
// Implementation defined variant number.
#define CPU_SCS_CPUID_VARIANT_W                                              4
#define CPU_SCS_CPUID_VARIANT_M                                     0x00F00000
#define CPU_SCS_CPUID_VARIANT_S                                             20

